<?php
Не используется. Все настройки устанавливаются вручную в файле index.php
и файлах пространств.

/*
//Перед вами главный конфигурационный файл Getting API
//НАСТРОЙКИ ПОДКЛЮЧЕНИЯ К БАЗЕ ДАННЫХ
$config = array();
//Адрес сервера(по умолчанию localhost):
$config['db']['host'] = 'localhost';
//Имя пользователя(по умолчанию root):
$config['db']['user'] = 'root';
//Пароль пользователя(по умолчанию пустая строка):
$config['db']['pass'] = '';
//Имя базы данных(по умолчанию api):
$config['db']['db_name'] = 'api';

//Конец файла конфигурации

*/